MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
extern volatile DMACH6BITS DMACH6bits __attribute__((__sfr__));

#define DMAINT6 DMAINT6
extern volatile uint16_t DMAINT6 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT6BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT6BITS;
extern volatile DMAINT6BITS DMAINT6bits __attribute__((__sfr__));

#define DMASRC6 DMASRC6
extern volatile uint16_t DMASRC6 __attribute__((__sfr__));
#define DMADST6 DMADST6
extern volatile uint16_t DMADST6 __attribute__((__sfr__));
#define DMACNT6 DMACNT6
extern volatile uint16_t DMACNT6 __attribute__((__sfr__));
#define DMACH7 DMACH7
extern volatile uint16_t DMACH7 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH7BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH7BITS;
extern volatile DMACH7BITS DMACH7bits __attribute__((__sfr__));

#define DMAINT7 DMAINT7
extern volatile uint16_t DMAINT7 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT7BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT7BITS;
extern volatile DMAINT7BITS DMAINT7bits __attribute__((__sfr__));

#define DMASRC7 DMASRC7
extern volatile uint16_t DMASRC7 __attribute__((__sfr__));
#define DMADST7 DMADST7
extern volatile uint16_t DMADST7 __attribute__((__sfr__));
#define DMACNT7 DMACNT7
extern volatile uint16_t DMACNT7 __attribute__((__sfr__));
#define PADCON PADCON
extern volatile uint16_t PADCON __attribute__((__sfr__));
typedef struct tagPADCONBITS {
  uint16_t PMPTTL:1;
  uint16_t :14;
  uint16_t IOCON:1;
} PADCONBITS;
extern volatile PADCONBITS PADCONbits __attribute__((__sfr__));

#define IOCSTAT IOCSTAT
extern volatile uint16_t IOCSTAT __attribute__((__sfr__));
typedef struct tagIOCSTATBITS {
  uint16_t IOCPAF:1;
  uint16_t IOCPBF:1;
  uint16_t IOCPCF:1;
  uint16_t IOCPDF:1;
  uint16_t IOCPEF:1;
  uint16_t IOCPFF:1;
  uint16_t IOCPGF:1;
} IOCSTATBITS;
extern volatile IOCSTATBITS IOCSTATbits __attribute__((__sfr__));

#define TRISA TRISA
extern volatile uint16_t TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
  uint16_t TRISA5:1;
  uint16_t TRISA6:1;
  uint16_t TRISA7:1;
  uint16_t :1;
  uint16_t TRISA9:1;
  uint16_t TRISA10:1;
  uint16_t :3;
  uint16_t TRISA14:1;
  uint16_t TRISA15:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
  uint16_t RA5:1;
  uint16_t RA6:1;
  uint16_t RA7:1;
  uint16_t :1;
  uint16_t RA9:1;
  uint16_t RA10:1;
  uint16_t :3;
  uint16_t RA14:1;
  uint16_t RA15:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
  uint16_t LATA5:1;
  uint16_t LATA6:1;
  uint16_t LATA7:1;
  uint16_t :1;
  uint16_t LATA9:1;
  uint16_t LATA10:1;
  uint16_t :3;
  uint16_t LATA14:1;
  uint16_t LATA15:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile uint16_t ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  uint16_t ODCA0:1;
  uint16_t ODCA1:1;
  uint16_t ODCA2:1;
  uint16_t ODCA3:1;
  uint16_t ODCA4:1;
  uint16_t ODCA5:1;
  uint16_t ODCA6:1;
  uint16_t ODCA7:1;
  uint16_t :1;
  uint16_t ODCA9:1;
  uint16_t ODCA10:1;
  uint16_t :3;
  uint16_t ODCA14:1;
  uint16_t ODCA15:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile uint16_t ANSA __attribute__((__sfr__));
__extension__ typedef struct tagANSABITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSA6:1;
      uint16_t ANSA7:1;
      uint16_t :1;
      uint16_t ANSA9:1;
      uint16_t ANSA10:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELA6:1;
      uint16_t ANSELA7:1;
      uint16_t :1;
      uint16_t ANSELA9:1;
      uint16_t ANSELA10:1;
    };
  };
} ANSABITS;
extern volatile ANSABITS ANSAbits __attribute__((__sfr__));

#define ANSELA ANSELA
extern volatile uint16_t ANSELA __attribute__((__sfr__));
__extension__ typedef struct tagANSELABITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSA6:1;
      uint16_t ANSA7:1;
      uint16_t :1;
      uint16_t ANSA9:1;
      uint16_t ANSA10:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELA6:1;
      uint16_t ANSELA7:1;
      uint16_t :1;
      uint16_t ANSELA9:1;
      uint16_t ANSELA10:1;
    };
  };
} ANSELABITS;
extern volatile ANSELABITS ANSELAbits __attribute__((__sfr__));

#define IOCPA IOCPA
extern volatile uint16_t IOCPA __attribute__((__sfr__));
typedef struct tagIOCPABITS {
  uint16_t IOCPA0:1;
  uint16_t IOCPA1:1;
  uint16_t IOCPA2:1;
  uint16_t IOCPA3:1;
  uint16_t IOCPA4:1;
  uint16_t IOCPA5:1;
  uint16_t IOCPA6:1;
  uint16_t IOCPA7:1;
  uint16_t :1;
  uint16_t IOCPA9:1;
  uint16_t IOCPA10:1;
  uint16_t :3;
  uint16_t IOCPA14:1;
  uint16_t IOCPA15:1;
} IOCPABITS;
extern volatile IOCPABITS IOCPAbits __attribute__((__sfr__));

#define IOCNA IOCNA
extern volatile uint16_t IOCNA __attribute__((__sfr__));
typedef struct tagIOCNABITS {
  uint16_t IOCNA0:1;
  uint16_t IOCNA1:1;
  uint16_t IOCNA2:1;
  uint16_t IOCNA3:1;
  uint16_t IOCNA4:1;
  uint16_t IOCNA5:1;
  uint16_t IOCNA6:1;
  uint16_t IOCNA7:1;
  uint16_t :1;
  uint16_t IOCNA9:1;
  uint16_t IOCNA10:1;
  uint16_t :3;
  uint16_t IOCNA14:1;
  uint16_t IOCNA15:1;
} IOCNABITS;
extern volatile IOCNABITS IOCNAbits __attribute__((__sfr__));

#define IOCFA IOCFA
extern volatile uint16_t IOCFA __attribute__((__sfr__));
typedef struct tagIOCFABITS {
  uint16_t IOCFA0:1;
  uint16_t IOCFA1:1;
  uint16_t IOCFA2:1;
  uint16_t IOCFA3:1;
  uint16_t IOCFA4:1;
  uint16_t IOCFA5:1;
  uint16_t IOCFA6:1;
  uint16_t IOCFA7:1;
  uint16_t :1;
  uint16_t IOCFA9:1;
  uint16_t IOCFA10:1;
  uint16_t :3;
  uint16_t IOCFA14:1;
  uint16_t IOCFA15:1;
} IOCFABITS;
extern volatile IOCFABITS IOCFAbits __attribute__((__sfr__));

#define CNPUA CNPUA
extern volatile uint16_t CNPUA __attribute__((__sfr__));
__extension__ typedef struct tagCNPUABITS {
  union {
    struct {
      uint16_t IOCPA0:1;
      uint16_t IOCPA1:1;
      uint16_t IOCPA2:1;
      uint16_t IOCPA3:1;
      uint16_t IOCPA4:1;
      uint16_t IOCPA5:1;
      uint16_t IOCPA6:1;
      uint16_t IOCPA7:1;
      uint16_t :1;
      uint16_t IOCPA9:1;
      uint16_t IOCPA10:1;
      uint16_t :3;
      uint16_t IOCPA14:1;
      uint16_t IOCPA15:1;
    };
    struct {
      uint16_t IOCPUA0:1;
      uint16_t IOCPUA1:1;
      uint16_t IOCPUA2:1;
      uint16_t IOCPUA3:1;
      uint16_t IOCPUA4:1;
      uint16_t IOCPUA5:1;
      uint16_t IOCPUA6:1;
      uint16_t IOCPUA7:1;
      uint16_t :1;
      uint16_t IOCPUA9:1;
      uint16_t IOCPUA10:1;
      uint16_t :3;
      uint16_t IOCPUA14:1;
      uint16_t IOCPUA15:1;
    };
    struct {
      uint16_t CNPUA0:1;
      uint16_t CNPUA1:1;
      uint16_t CNPUA2:1;
      uint16_t CNPUA3:1;
      uint16_t CNPUA4:1;
      uint16_t CNPUA5:1;
      uint16_t CNPUA6:1;
      uint16_t CNPUA7:1;
      uint16_t :1;
      uint16_t CNPUA9:1;
      uint16_t CNPUA10:1;
      uint16_t :3;
      uint16_t CNPUA14:1;
      uint16_t CNPUA15:1;
    };
  };
} CNPUABITS;
