MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t RF2:1;
  uint16_t RF3:1;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t RF6:1;
  uint16_t RF7:1;
  uint16_t RF8:1;
  uint16_t :3;
  uint16_t RF12:1;
  uint16_t RF13:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t LATF2:1;
  uint16_t LATF3:1;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t LATF6:1;
  uint16_t LATF7:1;
  uint16_t LATF8:1;
  uint16_t :3;
  uint16_t LATF12:1;
  uint16_t LATF13:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODCF0:1;
  uint16_t ODCF1:1;
  uint16_t ODCF2:1;
  uint16_t ODCF3:1;
  uint16_t ODCF4:1;
  uint16_t ODCF5:1;
  uint16_t ODCF6:1;
  uint16_t ODCF7:1;
  uint16_t ODCF8:1;
  uint16_t :3;
  uint16_t ODCF12:1;
  uint16_t ODCF13:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile uint16_t ANSELF __attribute__((__sfr__));
#define ANSF ANSF
extern volatile uint16_t ANSF __attribute__((__sfr__));
#define IOCPF IOCPF
extern volatile uint16_t IOCPF __attribute__((__sfr__));
typedef struct tagIOCPFBITS {
  uint16_t IOCPF0:1;
  uint16_t IOCPF1:1;
  uint16_t IOCPF2:1;
  uint16_t IOCPF3:1;
  uint16_t IOCPF4:1;
  uint16_t IOCPF5:1;
  uint16_t IOCPF6:1;
  uint16_t IOCPF7:1;
  uint16_t IOCPF8:1;
  uint16_t :3;
  uint16_t IOCPF12:1;
  uint16_t IOCPF13:1;
} IOCPFBITS;
extern volatile IOCPFBITS IOCPFbits __attribute__((__sfr__));

#define IOCNF IOCNF
extern volatile uint16_t IOCNF __attribute__((__sfr__));
typedef struct tagIOCNFBITS {
  uint16_t IOCNF0:1;
  uint16_t IOCNF1:1;
  uint16_t IOCNF2:1;
  uint16_t IOCNF3:1;
  uint16_t IOCNF4:1;
  uint16_t IOCNF5:1;
  uint16_t IOCNF6:1;
  uint16_t IOCNF7:1;
  uint16_t IOCNF8:1;
  uint16_t :3;
  uint16_t IOCNF12:1;
  uint16_t IOCNF13:1;
} IOCNFBITS;
extern volatile IOCNFBITS IOCNFbits __attribute__((__sfr__));

#define IOCFF IOCFF
extern volatile uint16_t IOCFF __attribute__((__sfr__));
typedef struct tagIOCFFBITS {
  uint16_t IOCFF0:1;
  uint16_t IOCFF1:1;
  uint16_t IOCFF2:1;
  uint16_t IOCFF3:1;
  uint16_t IOCFF4:1;
  uint16_t IOCFF5:1;
  uint16_t IOCFF6:1;
  uint16_t IOCFF7:1;
  uint16_t IOCFF8:1;
  uint16_t :3;
  uint16_t IOCFF12:1;
  uint16_t IOCFF13:1;
} IOCFFBITS;
extern volatile IOCFFBITS IOCFFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile uint16_t CNPUF __attribute__((__sfr__));
__extension__ typedef struct tagCNPUFBITS {
  union {
    struct {
      uint16_t IOCPF0:1;
      uint16_t IOCPF1:1;
      uint16_t IOCPF2:1;
      uint16_t IOCPF3:1;
      uint16_t IOCPF4:1;
      uint16_t IOCPF5:1;
      uint16_t IOCPF6:1;
      uint16_t IOCPF7:1;
      uint16_t IOCPF8:1;
      uint16_t :3;
      uint16_t IOCPF12:1;
      uint16_t IOCPF13:1;
    };
    struct {
      uint16_t IOCPUF0:1;
      uint16_t IOCPUF1:1;
      uint16_t IOCPUF2:1;
      uint16_t IOCPUF3:1;
      uint16_t IOCPUF4:1;
      uint16_t IOCPUF5:1;
      uint16_t IOCPUF6:1;
      uint16_t IOCPUF7:1;
      uint16_t IOCPUF8:1;
      uint16_t :3;
      uint16_t IOCPUF12:1;
      uint16_t IOCPUF13:1;
    };
    struct {
      uint16_t CNPUF0:1;
      uint16_t CNPUF1:1;
      uint16_t CNPUF2:1;
      uint16_t CNPUF3:1;
      uint16_t CNPUF4:1;
      uint16_t CNPUF5:1;
      uint16_t CNPUF6:1;
      uint16_t CNPUF7:1;
      uint16_t CNPUF8:1;
      uint16_t :3;
      uint16_t CNPUF12:1;
      uint16_t CNPUF13:1;
    };
  };
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

#define IOCPUF IOCPUF
extern volatile uint16_t IOCPUF __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUFBITS {
  union {
    struct {
      uint16_t IOCPF0:1;
      uint16_t IOCPF1:1;
      uint16_t IOCPF2:1;
      uint16_t IOCPF3:1;
      uint16_t IOCPF4:1;
      uint16_t IOCPF5:1;
      uint16_t IOCPF6:1;
      uint16_t IOCPF7:1;
      uint16_t IOCPF8:1;
      uint16_t :3;
      uint16_t IOCPF12:1;
      uint16_t IOCPF13:1;
    };
    struct {
      uint16_t IOCPUF0:1;
      uint16_t IOCPUF1:1;
      uint16_t IOCPUF2:1;
      uint16_t IOCPUF3:1;
      uint16_t IOCPUF4:1;
      uint16_t IOCPUF5:1;
      uint16_t IOCPUF6:1;
      uint16_t IOCPUF7:1;
      uint16_t IOCPUF8:1;
      uint16_t :3;
      uint16_t IOCPUF12:1;
      uint16_t IOCPUF13:1;
    };
    struct {
      uint16_t CNPUF0:1;
      uint16_t CNPUF1:1;
      uint16_t CNPUF2:1;
      uint16_t CNPUF3:1;
      uint16_t CNPUF4:1;
      uint16_t CNPUF5:1;
      uint16_t CNPUF6:1;
      uint16_t CNPUF7:1;
      uint16_t CNPUF8:1;
      uint16_t :3;
      uint16_t CNPUF12:1;
      uint16_t CNPUF13:1;
    };
  };
} IOCPUFBITS;
extern volatile IOCPUFBITS IOCPUFbits __attribute__((__sfr__));

#define CNPDF CNPDF
extern volatile uint16_t CNPDF __attribute__((__sfr__));
__extension__ typedef struct tagCNPDFBITS {
  union {
    struct {
      uint16_t IOCPDF0:1;
      uint16_t IOCPDF1:1;
      uint16_t IOCPDF2:1;
      uint16_t IOCPDF3:1;
      uint16_t IOCPDF4:1;
      uint16_t IOCPDF5:1;
      uint16_t IOCPDF6:1;
      uint16_t IOCPDF7:1;
      uint16_t IOCPDF8:1;
      uint16_t :3;
      uint16_t IOCPDF12:1;
      uint16_t IOCPDF13:1;
    };
    struct {
      uint16_t CNPDF0:1;
      uint16_t CNPDF1:1;
      uint16_t CNPDF2:1;
      uint16_t CNPDF3:1;
      uint16_t CNPDF4:1;
      uint16_t CNPDF5:1;
      uint16_t CNPDF6:1;
      uint16_t CNPDF7:1;
      uint16_t CNPDF8:1;
      uint16_t :3;
      uint16_t CNPDF12:1;
      uint16_t CNPDF13:1;
    };
  };
} CNPDFBITS;
extern volatile CNPDFBITS CNPDFbits __attribute__((__sfr__));

#define IOCPDF IOCPDF
extern volatile uint16_t IOCPDF __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDFBITS {
  union {
    struct {
      uint16_t IOCPDF0:1;
      uint16_t IOCPDF1:1;
      uint16_t IOCPDF2:1;
      uint16_t IOCPDF3:1;
      uint16_t IOCPDF4:1;
      uint16_t IOCPDF5:1;
      uint16_t IOCPDF6:1;
      uint16_t IOCPDF7:1;
      uint16_t IOCPDF8:1;
      uint16_t :3;
      uint16_t IOCPDF12:1;
      uint16_t IOCPDF13:1;
    };
    struct {
      uint16_t CNPDF0:1;
      uint16_t CNPDF1:1;
      uint16_t CNPDF2:1;
      uint16_t CNPDF3:1;
      uint16_t CNPDF4:1;
      uint16_t CNPDF5:1;
      uint16_t CNPDF6:1;
      uint16_t CNPDF7:1;
      uint16_t CNPDF8:1;
      uint16_t :3;
      uint16_t CNPDF12:1;
      uint16_t CNPDF13:1;
    };
  };
} IOCPDFBITS;
extern volatile IOCPDFBITS IOCPDFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile uint16_t TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  uint16_t TRISG0:1;
  uint16_t TRISG1:1;
  uint16_t TRISG2:1;
  uint16_t TRISG3:1;
  uint16_t :2;
  uint16_t TRISG6:1;
  uint16_t TRISG7:1;
  uint16_t TRISG8:1;
  uint16_t TRISG9:1;
  uint16_t :2;
  uint16_t TRISG12:1;
  uint16_t TRISG13:1;
  uint16_t TRISG14:1;
  uint16_t TRISG15:1;
} TRISGBITS;
