MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
/* IOCFC */
#define _IOCFC1 IOCFCbits.IOCFC1
#define _IOCFC2 IOCFCbits.IOCFC2
#define _IOCFC3 IOCFCbits.IOCFC3
#define _IOCFC4 IOCFCbits.IOCFC4
#define _IOCFC12 IOCFCbits.IOCFC12
#define _IOCFC13 IOCFCbits.IOCFC13
#define _IOCFC14 IOCFCbits.IOCFC14
#define _IOCFC15 IOCFCbits.IOCFC15

/* CNPUC */
/* Bitname _IOCPC1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */
#define _IOCPUC1 CNPUCbits.IOCPUC1
#define _IOCPUC2 CNPUCbits.IOCPUC2
#define _IOCPUC3 CNPUCbits.IOCPUC3
#define _IOCPUC4 CNPUCbits.IOCPUC4
#define _IOCPUC12 CNPUCbits.IOCPUC12
#define _IOCPUC13 CNPUCbits.IOCPUC13
#define _IOCPUC14 CNPUCbits.IOCPUC14
#define _IOCPUC15 CNPUCbits.IOCPUC15
#define _CNPUC1 CNPUCbits.CNPUC1
#define _CNPUC2 CNPUCbits.CNPUC2
#define _CNPUC3 CNPUCbits.CNPUC3
#define _CNPUC4 CNPUCbits.CNPUC4
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC13 CNPUCbits.CNPUC13
#define _CNPUC14 CNPUCbits.CNPUC14
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _IOCPDC1 CNPDCbits.IOCPDC1
#define _IOCPDC2 CNPDCbits.IOCPDC2
#define _IOCPDC3 CNPDCbits.IOCPDC3
#define _IOCPDC4 CNPDCbits.IOCPDC4
#define _IOCPDC12 CNPDCbits.IOCPDC12
#define _IOCPDC13 CNPDCbits.IOCPDC13
#define _IOCPDC14 CNPDCbits.IOCPDC14
#define _IOCPDC15 CNPDCbits.IOCPDC15
#define _CNPDC1 CNPDCbits.CNPDC1
#define _CNPDC2 CNPDCbits.CNPDC2
#define _CNPDC3 CNPDCbits.CNPDC3
#define _CNPDC4 CNPDCbits.CNPDC4
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC13 CNPDCbits.CNPDC13
#define _CNPDC14 CNPDCbits.CNPDC14
#define _CNPDC15 CNPDCbits.CNPDC15

/* TRISD */
#define _TRISD0 TRISDbits.TRISD0
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD2 TRISDbits.TRISD2
#define _TRISD3 TRISDbits.TRISD3
#define _TRISD4 TRISDbits.TRISD4
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD7 TRISDbits.TRISD7
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD9 TRISDbits.TRISD9
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD11 TRISDbits.TRISD11
#define _TRISD12 TRISDbits.TRISD12
#define _TRISD13 TRISDbits.TRISD13
#define _TRISD14 TRISDbits.TRISD14
#define _TRISD15 TRISDbits.TRISD15

/* PORTD */
#define _RD0 PORTDbits.RD0
#define _RD1 PORTDbits.RD1
#define _RD2 PORTDbits.RD2
#define _RD3 PORTDbits.RD3
#define _RD4 PORTDbits.RD4
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD7 PORTDbits.RD7
#define _RD8 PORTDbits.RD8
#define _RD9 PORTDbits.RD9
#define _RD10 PORTDbits.RD10
#define _RD11 PORTDbits.RD11
#define _RD12 PORTDbits.RD12
#define _RD13 PORTDbits.RD13
#define _RD14 PORTDbits.RD14
#define _RD15 PORTDbits.RD15

/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11
#define _LATD12 LATDbits.LATD12
#define _LATD13 LATDbits.LATD13
#define _LATD14 LATDbits.LATD14
#define _LATD15 LATDbits.LATD15

/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD7 ODCDbits.ODCD7
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11
#define _ODCD12 ODCDbits.ODCD12
#define _ODCD13 ODCDbits.ODCD13
#define _ODCD14 ODCDbits.ODCD14
#define _ODCD15 ODCDbits.ODCD15

/* ANSD */
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSELD6 ANSDbits.ANSELD6
#define _ANSELD7 ANSDbits.ANSELD7

/* IOCPD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD15 cannot be defined because it is used by more than one SFR */

/* IOCND */
#define _IOCND0 IOCNDbits.IOCND0
#define _IOCND1 IOCNDbits.IOCND1
#define _IOCND2 IOCNDbits.IOCND2
#define _IOCND3 IOCNDbits.IOCND3
#define _IOCND4 IOCNDbits.IOCND4
#define _IOCND5 IOCNDbits.IOCND5
#define _IOCND6 IOCNDbits.IOCND6
#define _IOCND7 IOCNDbits.IOCND7
#define _IOCND8 IOCNDbits.IOCND8
#define _IOCND9 IOCNDbits.IOCND9
#define _IOCND10 IOCNDbits.IOCND10
#define _IOCND11 IOCNDbits.IOCND11
#define _IOCND12 IOCNDbits.IOCND12
#define _IOCND13 IOCNDbits.IOCND13
#define _IOCND14 IOCNDbits.IOCND14
#define _IOCND15 IOCNDbits.IOCND15

/* IOCFD */
#define _IOCFD0 IOCFDbits.IOCFD0
#define _IOCFD1 IOCFDbits.IOCFD1
#define _IOCFD2 IOCFDbits.IOCFD2
#define _IOCFD3 IOCFDbits.IOCFD3
#define _IOCFD4 IOCFDbits.IOCFD4
#define _IOCFD5 IOCFDbits.IOCFD5
#define _IOCFD6 IOCFDbits.IOCFD6
#define _IOCFD7 IOCFDbits.IOCFD7
#define _IOCFD8 IOCFDbits.IOCFD8
#define _IOCFD9 IOCFDbits.IOCFD9
#define _IOCFD10 IOCFDbits.IOCFD10
#define _IOCFD11 IOCFDbits.IOCFD11
#define _IOCFD12 IOCFDbits.IOCFD12
#define _IOCFD13 IOCFDbits.IOCFD13
#define _IOCFD14 IOCFDbits.IOCFD14
#define _IOCFD15 IOCFDbits.IOCFD15

/* CNPUD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD15 cannot be defined because it is used by more than one SFR */
#define _IOCPUD0 CNPUDbits.IOCPUD0
#define _IOCPUD1 CNPUDbits.IOCPUD1
#define _IOCPUD2 CNPUDbits.IOCPUD2
#define _IOCPUD3 CNPUDbits.IOCPUD3
#define _IOCPUD4 CNPUDbits.IOCPUD4
#define _IOCPUD5 CNPUDbits.IOCPUD5
#define _IOCPUD6 CNPUDbits.IOCPUD6
#define _IOCPUD7 CNPUDbits.IOCPUD7
#define _IOCPUD8 CNPUDbits.IOCPUD8
#define _IOCPUD9 CNPUDbits.IOCPUD9
#define _IOCPUD10 CNPUDbits.IOCPUD10
#define _IOCPUD11 CNPUDbits.IOCPUD11
#define _IOCPUD12 CNPUDbits.IOCPUD12
#define _IOCPUD13 CNPUDbits.IOCPUD13
#define _IOCPUD14 CNPUDbits.IOCPUD14
#define _IOCPUD15 CNPUDbits.IOCPUD15
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11
#define _CNPUD12 CNPUDbits.CNPUD12
#define _CNPUD13 CNPUDbits.CNPUD13
#define _CNPUD14 CNPUDbits.CNPUD14
#define _CNPUD15 CNPUDbits.CNPUD15

