MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
#define _IEC5_U3TXIE_POSITION                    0x00000003
#define _IEC5_U3TXIE_MASK                        0x00000008
#define _IEC5_U3TXIE_LENGTH                      0x00000001

#define _IEC5_I2C1BCIE_POSITION                  0x00000004
#define _IEC5_I2C1BCIE_MASK                      0x00000010
#define _IEC5_I2C1BCIE_LENGTH                    0x00000001

#define _IEC5_I2C2BCIE_POSITION                  0x00000005
#define _IEC5_I2C2BCIE_MASK                      0x00000020
#define _IEC5_I2C2BCIE_LENGTH                    0x00000001

#define _IEC5_U4ERIE_POSITION                    0x00000007
#define _IEC5_U4ERIE_MASK                        0x00000080
#define _IEC5_U4ERIE_LENGTH                      0x00000001

#define _IEC5_U4RXIE_POSITION                    0x00000008
#define _IEC5_U4RXIE_MASK                        0x00000100
#define _IEC5_U4RXIE_LENGTH                      0x00000001

#define _IEC5_U4TXIE_POSITION                    0x00000009
#define _IEC5_U4TXIE_MASK                        0x00000200
#define _IEC5_U4TXIE_LENGTH                      0x00000001

#define _IEC5_SPI3IE_POSITION                    0x0000000A
#define _IEC5_SPI3IE_MASK                        0x00000400
#define _IEC5_SPI3IE_LENGTH                      0x00000001

#define _IEC5_SPI3TXIE_POSITION                  0x0000000B
#define _IEC5_SPI3TXIE_MASK                      0x00000800
#define _IEC5_SPI3TXIE_LENGTH                    0x00000001

#define _IEC5_CCP3IE_POSITION                    0x0000000E
#define _IEC5_CCP3IE_MASK                        0x00004000
#define _IEC5_CCP3IE_LENGTH                      0x00000001

#define _IEC5_CCP4IE_POSITION                    0x0000000F
#define _IEC5_CCP4IE_MASK                        0x00008000
#define _IEC5_CCP4IE_LENGTH                      0x00000001

#define _IEC6_CLC1IE_POSITION                    0x00000000
#define _IEC6_CLC1IE_MASK                        0x00000001
#define _IEC6_CLC1IE_LENGTH                      0x00000001

#define _IEC6_CLC2IE_POSITION                    0x00000001
#define _IEC6_CLC2IE_MASK                        0x00000002
#define _IEC6_CLC2IE_LENGTH                      0x00000001

#define _IEC6_CLC3IE_POSITION                    0x00000002
#define _IEC6_CLC3IE_MASK                        0x00000004
#define _IEC6_CLC3IE_LENGTH                      0x00000001

#define _IEC6_CLC4IE_POSITION                    0x00000003
#define _IEC6_CLC4IE_MASK                        0x00000008
#define _IEC6_CLC4IE_LENGTH                      0x00000001

#define _IEC6_CCT1IE_POSITION                    0x00000005
#define _IEC6_CCT1IE_MASK                        0x00000020
#define _IEC6_CCT1IE_LENGTH                      0x00000001

#define _IEC6_CCT2IE_POSITION                    0x00000006
#define _IEC6_CCT2IE_MASK                        0x00000040
#define _IEC6_CCT2IE_LENGTH                      0x00000001

#define _IEC6_FSTIE_POSITION                     0x0000000A
#define _IEC6_FSTIE_MASK                         0x00000400
#define _IEC6_FSTIE_LENGTH                       0x00000001

#define _IEC6_I2C3BCIE_POSITION                  0x0000000D
#define _IEC6_I2C3BCIE_MASK                      0x00002000
#define _IEC6_I2C3BCIE_LENGTH                    0x00000001

#define _IEC6_RTCCTSIE_POSITION                  0x0000000E
#define _IEC6_RTCCTSIE_MASK                      0x00004000
#define _IEC6_RTCCTSIE_LENGTH                    0x00000001

#define _IEC6_U5RXIE_POSITION                    0x0000000F
#define _IEC6_U5RXIE_MASK                        0x00008000
#define _IEC6_U5RXIE_LENGTH                      0x00000001

#define _IEC7_U5TXIE_POSITION                    0x00000000
#define _IEC7_U5TXIE_MASK                        0x00000001
#define _IEC7_U5TXIE_LENGTH                      0x00000001

#define _IEC7_U5ERIE_POSITION                    0x00000001
#define _IEC7_U5ERIE_MASK                        0x00000002
#define _IEC7_U5ERIE_LENGTH                      0x00000001

#define _IEC7_U6RXIE_POSITION                    0x00000002
#define _IEC7_U6RXIE_MASK                        0x00000004
#define _IEC7_U6RXIE_LENGTH                      0x00000001

#define _IEC7_U6TXIE_POSITION                    0x00000003
#define _IEC7_U6TXIE_MASK                        0x00000008
#define _IEC7_U6TXIE_LENGTH                      0x00000001

#define _IEC7_U6ERIE_POSITION                    0x00000004
#define _IEC7_U6ERIE_MASK                        0x00000010
#define _IEC7_U6ERIE_LENGTH                      0x00000001

#define _IEC7_JTAGIE_POSITION                    0x00000005
#define _IEC7_JTAGIE_MASK                        0x00000020
#define _IEC7_JTAGIE_LENGTH                      0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

#define _IPC0_INT0IP2_POSITION                   0x00000002
#define _IPC0_INT0IP2_MASK                       0x00000004
#define _IPC0_INT0IP2_LENGTH                     0x00000001

#define _IPC0_IC1IP0_POSITION                    0x00000004
#define _IPC0_IC1IP0_MASK                        0x00000010
#define _IPC0_IC1IP0_LENGTH                      0x00000001

#define _IPC0_IC1IP1_POSITION                    0x00000005
#define _IPC0_IC1IP1_MASK                        0x00000020
#define _IPC0_IC1IP1_LENGTH                      0x00000001

#define _IPC0_IC1IP2_POSITION                    0x00000006
#define _IPC0_IC1IP2_MASK                        0x00000040
#define _IPC0_IC1IP2_LENGTH                      0x00000001

#define _IPC0_OC1IP0_POSITION                    0x00000008
#define _IPC0_OC1IP0_MASK                        0x00000100
#define _IPC0_OC1IP0_LENGTH                      0x00000001

#define _IPC0_OC1IP1_POSITION                    0x00000009
#define _IPC0_OC1IP1_MASK                        0x00000200
#define _IPC0_OC1IP1_LENGTH                      0x00000001

