MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
#define _PMD2_OC3MD_POSITION                     0x00000002
#define _PMD2_OC3MD_MASK                         0x00000004
#define _PMD2_OC3MD_LENGTH                       0x00000001

#define _PMD2_OC4MD_POSITION                     0x00000003
#define _PMD2_OC4MD_MASK                         0x00000008
#define _PMD2_OC4MD_LENGTH                       0x00000001

#define _PMD2_OC5MD_POSITION                     0x00000004
#define _PMD2_OC5MD_MASK                         0x00000010
#define _PMD2_OC5MD_LENGTH                       0x00000001

#define _PMD2_OC6MD_POSITION                     0x00000005
#define _PMD2_OC6MD_MASK                         0x00000020
#define _PMD2_OC6MD_LENGTH                       0x00000001

#define _PMD2_OC7MD_POSITION                     0x00000006
#define _PMD2_OC7MD_MASK                         0x00000040
#define _PMD2_OC7MD_LENGTH                       0x00000001

#define _PMD2_OC8MD_POSITION                     0x00000007
#define _PMD2_OC8MD_MASK                         0x00000080
#define _PMD2_OC8MD_LENGTH                       0x00000001

#define _PMD2_IC1MD_POSITION                     0x00000008
#define _PMD2_IC1MD_MASK                         0x00000100
#define _PMD2_IC1MD_LENGTH                       0x00000001

#define _PMD2_IC2MD_POSITION                     0x00000009
#define _PMD2_IC2MD_MASK                         0x00000200
#define _PMD2_IC2MD_LENGTH                       0x00000001

#define _PMD2_IC3MD_POSITION                     0x0000000A
#define _PMD2_IC3MD_MASK                         0x00000400
#define _PMD2_IC3MD_LENGTH                       0x00000001

#define _PMD2_IC4MD_POSITION                     0x0000000B
#define _PMD2_IC4MD_MASK                         0x00000800
#define _PMD2_IC4MD_LENGTH                       0x00000001

#define _PMD2_IC5MD_POSITION                     0x0000000C
#define _PMD2_IC5MD_MASK                         0x00001000
#define _PMD2_IC5MD_LENGTH                       0x00000001

#define _PMD2_IC6MD_POSITION                     0x0000000D
#define _PMD2_IC6MD_MASK                         0x00002000
#define _PMD2_IC6MD_LENGTH                       0x00000001

#define _PMD2_IC7MD_POSITION                     0x0000000E
#define _PMD2_IC7MD_MASK                         0x00004000
#define _PMD2_IC7MD_LENGTH                       0x00000001

#define _PMD2_IC8MD_POSITION                     0x0000000F
#define _PMD2_IC8MD_MASK                         0x00008000
#define _PMD2_IC8MD_LENGTH                       0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_I2C3MD_POSITION                    0x00000002
#define _PMD3_I2C3MD_MASK                        0x00000004
#define _PMD3_I2C3MD_LENGTH                      0x00000001

#define _PMD3_U3MD_POSITION                      0x00000003
#define _PMD3_U3MD_MASK                          0x00000008
#define _PMD3_U3MD_LENGTH                        0x00000001

#define _PMD3_CRCMD_POSITION                     0x00000007
#define _PMD3_CRCMD_MASK                         0x00000080
#define _PMD3_CRCMD_LENGTH                       0x00000001

#define _PMD3_PMPMD_POSITION                     0x00000008
#define _PMD3_PMPMD_MASK                         0x00000100
#define _PMD3_PMPMD_LENGTH                       0x00000001

#define _PMD3_RTCCMD_POSITION                    0x00000009
#define _PMD3_RTCCMD_MASK                        0x00000200
#define _PMD3_RTCCMD_LENGTH                      0x00000001

#define _PMD3_CMPMD_POSITION                     0x0000000A
#define _PMD3_CMPMD_MASK                         0x00000400
#define _PMD3_CMPMD_LENGTH                       0x00000001

#define _PMD4_USB1MD_POSITION                    0x00000000
#define _PMD4_USB1MD_MASK                        0x00000001
#define _PMD4_USB1MD_LENGTH                      0x00000001

#define _PMD4_LVDMD_POSITION                     0x00000001
#define _PMD4_LVDMD_MASK                         0x00000002
#define _PMD4_LVDMD_LENGTH                       0x00000001

#define _PMD4_CTMUMD_POSITION                    0x00000002
#define _PMD4_CTMUMD_MASK                        0x00000004
#define _PMD4_CTMUMD_LENGTH                      0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD4_U4MD_POSITION                      0x00000005
#define _PMD4_U4MD_MASK                          0x00000020
#define _PMD4_U4MD_LENGTH                        0x00000001

#define _PMD5_CCP1MD_POSITION                    0x00000000
#define _PMD5_CCP1MD_MASK                        0x00000001
#define _PMD5_CCP1MD_LENGTH                      0x00000001

#define _PMD5_CCP2MD_POSITION                    0x00000001
#define _PMD5_CCP2MD_MASK                        0x00000002
#define _PMD5_CCP2MD_LENGTH                      0x00000001

#define _PMD5_CCP3MD_POSITION                    0x00000002
#define _PMD5_CCP3MD_MASK                        0x00000004
#define _PMD5_CCP3MD_LENGTH                      0x00000001

#define _PMD5_CCP4MD_POSITION                    0x00000003
#define _PMD5_CCP4MD_MASK                        0x00000008
#define _PMD5_CCP4MD_LENGTH                      0x00000001

#define _PMD5_CCP5MD_POSITION                    0x00000004
#define _PMD5_CCP5MD_MASK                        0x00000010
#define _PMD5_CCP5MD_LENGTH                      0x00000001

#define _PMD5_CCP6MD_POSITION                    0x00000005
#define _PMD5_CCP6MD_MASK                        0x00000020
#define _PMD5_CCP6MD_LENGTH                      0x00000001

#define _PMD5_CCP7MD_POSITION                    0x00000006
#define _PMD5_CCP7MD_MASK                        0x00000040
#define _PMD5_CCP7MD_LENGTH                      0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD7_DMA0MD_POSITION                    0x00000004
#define _PMD7_DMA0MD_MASK                        0x00000010
#define _PMD7_DMA0MD_LENGTH                      0x00000001

#define _PMD7_DMA1MD_POSITION                    0x00000005
#define _PMD7_DMA1MD_MASK                        0x00000020
#define _PMD7_DMA1MD_LENGTH                      0x00000001

#define _PMD8_CLC1MD_POSITION                    0x00000002
#define _PMD8_CLC1MD_MASK                        0x00000004
#define _PMD8_CLC1MD_LENGTH                      0x00000001

#define _PMD8_CLC2MD_POSITION                    0x00000003
#define _PMD8_CLC2MD_MASK                        0x00000008
#define _PMD8_CLC2MD_LENGTH                      0x00000001

#define _PMD8_CLC3MD_POSITION                    0x00000004
#define _PMD8_CLC3MD_MASK                        0x00000010
#define _PMD8_CLC3MD_LENGTH                      0x00000001

#define _PMD8_CLC4MD_POSITION                    0x00000005
#define _PMD8_CLC4MD_MASK                        0x00000020
#define _PMD8_CLC4MD_LENGTH                      0x00000001

#define _PMD8_U5MD_POSITION                      0x00000006
#define _PMD8_U5MD_MASK                          0x00000040
#define _PMD8_U5MD_LENGTH                        0x00000001

#define _PMD8_U6MD_POSITION                      0x00000007
#define _PMD8_U6MD_MASK                          0x00000080
#define _PMD8_U6MD_LENGTH                        0x00000001

