MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
#define _ALMTIMEH_MINONE_POSITION                0x00000000
#define _ALMTIMEH_MINONE_MASK                    0x0000000F
#define _ALMTIMEH_MINONE_LENGTH                  0x00000004

#define _ALMTIMEH_MINTEN_POSITION                0x00000004
#define _ALMTIMEH_MINTEN_MASK                    0x00000070
#define _ALMTIMEH_MINTEN_LENGTH                  0x00000003

#define _ALMTIMEH_HRONE_POSITION                 0x00000008
#define _ALMTIMEH_HRONE_MASK                     0x00000F00
#define _ALMTIMEH_HRONE_LENGTH                   0x00000004

#define _ALMTIMEH_HRTEN_POSITION                 0x0000000C
#define _ALMTIMEH_HRTEN_MASK                     0x00003000
#define _ALMTIMEH_HRTEN_LENGTH                   0x00000002

#define _ALMDATEL_WDAY_POSITION                  0x00000000
#define _ALMDATEL_WDAY_MASK                      0x00000007
#define _ALMDATEL_WDAY_LENGTH                    0x00000003

#define _ALMDATEL_DAYONE_POSITION                0x00000008
#define _ALMDATEL_DAYONE_MASK                    0x00000F00
#define _ALMDATEL_DAYONE_LENGTH                  0x00000004

#define _ALMDATEL_DAYTEN_POSITION                0x0000000C
#define _ALMDATEL_DAYTEN_MASK                    0x00003000
#define _ALMDATEL_DAYTEN_LENGTH                  0x00000002

#define _ALMDATEH_MTHONE_POSITION                0x00000000
#define _ALMDATEH_MTHONE_MASK                    0x0000000F
#define _ALMDATEH_MTHONE_LENGTH                  0x00000004

#define _ALMDATEH_MTHTEN_POSITION                0x00000004
#define _ALMDATEH_MTHTEN_MASK                    0x00000010
#define _ALMDATEH_MTHTEN_LENGTH                  0x00000001

#define _ALMDATEH_YRONE_POSITION                 0x00000008
#define _ALMDATEH_YRONE_MASK                     0x00000F00
#define _ALMDATEH_YRONE_LENGTH                   0x00000004

#define _ALMDATEH_YRTEN_POSITION                 0x0000000C
#define _ALMDATEH_YRTEN_MASK                     0x0000F000
#define _ALMDATEH_YRTEN_LENGTH                   0x00000004

#define _TSATIMEL_SECONE_POSITION                0x00000008
#define _TSATIMEL_SECONE_MASK                    0x00000F00
#define _TSATIMEL_SECONE_LENGTH                  0x00000004

#define _TSATIMEL_SECTEN_POSITION                0x0000000C
#define _TSATIMEL_SECTEN_MASK                    0x00007000
#define _TSATIMEL_SECTEN_LENGTH                  0x00000003

#define _TSATIMEH_MINONE_POSITION                0x00000000
#define _TSATIMEH_MINONE_MASK                    0x0000000F
#define _TSATIMEH_MINONE_LENGTH                  0x00000004

#define _TSATIMEH_MINTEN_POSITION                0x00000004
#define _TSATIMEH_MINTEN_MASK                    0x00000070
#define _TSATIMEH_MINTEN_LENGTH                  0x00000003

#define _TSATIMEH_HRONE_POSITION                 0x00000008
#define _TSATIMEH_HRONE_MASK                     0x00000F00
#define _TSATIMEH_HRONE_LENGTH                   0x00000004

#define _TSATIMEH_HRTEN_POSITION                 0x0000000C
#define _TSATIMEH_HRTEN_MASK                     0x00003000
#define _TSATIMEH_HRTEN_LENGTH                   0x00000002

#define _TSADATEL_WDAY_POSITION                  0x00000000
#define _TSADATEL_WDAY_MASK                      0x00000007
#define _TSADATEL_WDAY_LENGTH                    0x00000003

#define _TSADATEL_DAYONE_POSITION                0x00000008
#define _TSADATEL_DAYONE_MASK                    0x00000F00
#define _TSADATEL_DAYONE_LENGTH                  0x00000004

#define _TSADATEL_DAYTEN_POSITION                0x0000000C
#define _TSADATEL_DAYTEN_MASK                    0x00003000
#define _TSADATEL_DAYTEN_LENGTH                  0x00000002

#define _TSADATEH_MTHONE_POSITION                0x00000000
#define _TSADATEH_MTHONE_MASK                    0x0000000F
#define _TSADATEH_MTHONE_LENGTH                  0x00000004

#define _TSADATEH_MTHTEN_POSITION                0x00000004
#define _TSADATEH_MTHTEN_MASK                    0x00000010
#define _TSADATEH_MTHTEN_LENGTH                  0x00000001

#define _TSADATEH_YRONE_POSITION                 0x00000008
#define _TSADATEH_YRONE_MASK                     0x00000F00
#define _TSADATEH_YRONE_LENGTH                   0x00000004

#define _TSADATEH_YRTEN_POSITION                 0x0000000C
#define _TSADATEH_YRTEN_MASK                     0x0000F000
#define _TSADATEH_YRTEN_LENGTH                   0x00000004

#define _IC1CON1_ICM_POSITION                    0x00000000
#define _IC1CON1_ICM_MASK                        0x00000007
#define _IC1CON1_ICM_LENGTH                      0x00000003

#define _IC1CON1_ICBNE_POSITION                  0x00000003
#define _IC1CON1_ICBNE_MASK                      0x00000008
#define _IC1CON1_ICBNE_LENGTH                    0x00000001

#define _IC1CON1_ICOV_POSITION                   0x00000004
#define _IC1CON1_ICOV_MASK                       0x00000010
#define _IC1CON1_ICOV_LENGTH                     0x00000001

#define _IC1CON1_ICI_POSITION                    0x00000005
#define _IC1CON1_ICI_MASK                        0x00000060
#define _IC1CON1_ICI_LENGTH                      0x00000002

#define _IC1CON1_ICTSEL_POSITION                 0x0000000A
#define _IC1CON1_ICTSEL_MASK                     0x00001C00
#define _IC1CON1_ICTSEL_LENGTH                   0x00000003

#define _IC1CON1_ICSIDL_POSITION                 0x0000000D
#define _IC1CON1_ICSIDL_MASK                     0x00002000
#define _IC1CON1_ICSIDL_LENGTH                   0x00000001

#define _IC1CON1_ICM0_POSITION                   0x00000000
#define _IC1CON1_ICM0_MASK                       0x00000001
#define _IC1CON1_ICM0_LENGTH                     0x00000001

#define _IC1CON1_ICM1_POSITION                   0x00000001
#define _IC1CON1_ICM1_MASK                       0x00000002
#define _IC1CON1_ICM1_LENGTH                     0x00000001

#define _IC1CON1_ICM2_POSITION                   0x00000002
#define _IC1CON1_ICM2_MASK                       0x00000004
#define _IC1CON1_ICM2_LENGTH                     0x00000001

#define _IC1CON1_ICI0_POSITION                   0x00000005
#define _IC1CON1_ICI0_MASK                       0x00000020
#define _IC1CON1_ICI0_LENGTH                     0x00000001

#define _IC1CON1_ICI1_POSITION                   0x00000006
#define _IC1CON1_ICI1_MASK                       0x00000040
#define _IC1CON1_ICI1_LENGTH                     0x00000001

#define _IC1CON1_ICTSEL0_POSITION                0x0000000A
#define _IC1CON1_ICTSEL0_MASK                    0x00000400
#define _IC1CON1_ICTSEL0_LENGTH                  0x00000001

#define _IC1CON1_ICTSEL1_POSITION                0x0000000B
#define _IC1CON1_ICTSEL1_MASK                    0x00000800
#define _IC1CON1_ICTSEL1_LENGTH                  0x00000001

#define _IC1CON1_ICTSEL2_POSITION                0x0000000C
#define _IC1CON1_ICTSEL2_MASK                    0x00001000
#define _IC1CON1_ICTSEL2_LENGTH                  0x00000001

#define _IC1CON2_SYNCSEL_POSITION                0x00000000
#define _IC1CON2_SYNCSEL_MASK                    0x0000001F
#define _IC1CON2_SYNCSEL_LENGTH                  0x00000005

#define _IC1CON2_TRIGSTAT_POSITION               0x00000006
#define _IC1CON2_TRIGSTAT_MASK                   0x00000040
#define _IC1CON2_TRIGSTAT_LENGTH                 0x00000001

#define _IC1CON2_ICTRIG_POSITION                 0x00000007
#define _IC1CON2_ICTRIG_MASK                     0x00000080
#define _IC1CON2_ICTRIG_LENGTH                   0x00000001

