MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
#define _DMACH7_CHEN_POSITION                    0x00000000
#define _DMACH7_CHEN_MASK                        0x00000001
#define _DMACH7_CHEN_LENGTH                      0x00000001

#define _DMACH7_SIZE_POSITION                    0x00000001
#define _DMACH7_SIZE_MASK                        0x00000002
#define _DMACH7_SIZE_LENGTH                      0x00000001

#define _DMACH7_TRMODE_POSITION                  0x00000002
#define _DMACH7_TRMODE_MASK                      0x0000000C
#define _DMACH7_TRMODE_LENGTH                    0x00000002

#define _DMACH7_DAMODE_POSITION                  0x00000004
#define _DMACH7_DAMODE_MASK                      0x00000030
#define _DMACH7_DAMODE_LENGTH                    0x00000002

#define _DMACH7_SAMODE_POSITION                  0x00000006
#define _DMACH7_SAMODE_MASK                      0x000000C0
#define _DMACH7_SAMODE_LENGTH                    0x00000002

#define _DMACH7_CHREQ_POSITION                   0x00000008
#define _DMACH7_CHREQ_MASK                       0x00000100
#define _DMACH7_CHREQ_LENGTH                     0x00000001

#define _DMACH7_RELOAD_POSITION                  0x00000009
#define _DMACH7_RELOAD_MASK                      0x00000200
#define _DMACH7_RELOAD_LENGTH                    0x00000001

#define _DMACH7_NULLW_POSITION                   0x0000000A
#define _DMACH7_NULLW_MASK                       0x00000400
#define _DMACH7_NULLW_LENGTH                     0x00000001

#define _DMACH7_TRMODE0_POSITION                 0x00000002
#define _DMACH7_TRMODE0_MASK                     0x00000004
#define _DMACH7_TRMODE0_LENGTH                   0x00000001

#define _DMACH7_TRMODE1_POSITION                 0x00000003
#define _DMACH7_TRMODE1_MASK                     0x00000008
#define _DMACH7_TRMODE1_LENGTH                   0x00000001

#define _DMACH7_DAMODE0_POSITION                 0x00000004
#define _DMACH7_DAMODE0_MASK                     0x00000010
#define _DMACH7_DAMODE0_LENGTH                   0x00000001

#define _DMACH7_DAMODE1_POSITION                 0x00000005
#define _DMACH7_DAMODE1_MASK                     0x00000020
#define _DMACH7_DAMODE1_LENGTH                   0x00000001

#define _DMACH7_SAMODE0_POSITION                 0x00000006
#define _DMACH7_SAMODE0_MASK                     0x00000040
#define _DMACH7_SAMODE0_LENGTH                   0x00000001

#define _DMACH7_SAMODE1_POSITION                 0x00000007
#define _DMACH7_SAMODE1_MASK                     0x00000080
#define _DMACH7_SAMODE1_LENGTH                   0x00000001

#define _DMAINT7_HALFEN_POSITION                 0x00000000
#define _DMAINT7_HALFEN_MASK                     0x00000001
#define _DMAINT7_HALFEN_LENGTH                   0x00000001

#define _DMAINT7_OVRUNIF_POSITION                0x00000003
#define _DMAINT7_OVRUNIF_MASK                    0x00000008
#define _DMAINT7_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT7_HALFIF_POSITION                 0x00000004
#define _DMAINT7_HALFIF_MASK                     0x00000010
#define _DMAINT7_HALFIF_LENGTH                   0x00000001

#define _DMAINT7_DONEIF_POSITION                 0x00000005
#define _DMAINT7_DONEIF_MASK                     0x00000020
#define _DMAINT7_DONEIF_LENGTH                   0x00000001

#define _DMAINT7_LOWIF_POSITION                  0x00000006
#define _DMAINT7_LOWIF_MASK                      0x00000040
#define _DMAINT7_LOWIF_LENGTH                    0x00000001

#define _DMAINT7_HIGHIF_POSITION                 0x00000007
#define _DMAINT7_HIGHIF_MASK                     0x00000080
#define _DMAINT7_HIGHIF_LENGTH                   0x00000001

#define _DMAINT7_CHSEL_POSITION                  0x00000008
#define _DMAINT7_CHSEL_MASK                      0x00007F00
#define _DMAINT7_CHSEL_LENGTH                    0x00000007

#define _DMAINT7_DBUFWF_POSITION                 0x0000000F
#define _DMAINT7_DBUFWF_MASK                     0x00008000
#define _DMAINT7_DBUFWF_LENGTH                   0x00000001

#define _DMAINT7_CHSEL0_POSITION                 0x00000008
#define _DMAINT7_CHSEL0_MASK                     0x00000100
#define _DMAINT7_CHSEL0_LENGTH                   0x00000001

#define _DMAINT7_CHSEL1_POSITION                 0x00000009
#define _DMAINT7_CHSEL1_MASK                     0x00000200
#define _DMAINT7_CHSEL1_LENGTH                   0x00000001

#define _DMAINT7_CHSEL2_POSITION                 0x0000000A
#define _DMAINT7_CHSEL2_MASK                     0x00000400
#define _DMAINT7_CHSEL2_LENGTH                   0x00000001

#define _DMAINT7_CHSEL3_POSITION                 0x0000000B
#define _DMAINT7_CHSEL3_MASK                     0x00000800
#define _DMAINT7_CHSEL3_LENGTH                   0x00000001

#define _DMAINT7_CHSEL4_POSITION                 0x0000000C
#define _DMAINT7_CHSEL4_MASK                     0x00001000
#define _DMAINT7_CHSEL4_LENGTH                   0x00000001

#define _DMAINT7_CHSEL5_POSITION                 0x0000000D
#define _DMAINT7_CHSEL5_MASK                     0x00002000
#define _DMAINT7_CHSEL5_LENGTH                   0x00000001

#define _DMAINT7_CHSEL6_POSITION                 0x0000000E
#define _DMAINT7_CHSEL6_MASK                     0x00004000
#define _DMAINT7_CHSEL6_LENGTH                   0x00000001

#define _PADCON_PMPTTL_POSITION                  0x00000000
#define _PADCON_PMPTTL_MASK                      0x00000001
#define _PADCON_PMPTTL_LENGTH                    0x00000001

#define _PADCON_IOCON_POSITION                   0x0000000F
#define _PADCON_IOCON_MASK                       0x00008000
#define _PADCON_IOCON_LENGTH                     0x00000001

#define _IOCSTAT_IOCPAF_POSITION                 0x00000000
#define _IOCSTAT_IOCPAF_MASK                     0x00000001
#define _IOCSTAT_IOCPAF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPBF_POSITION                 0x00000001
#define _IOCSTAT_IOCPBF_MASK                     0x00000002
#define _IOCSTAT_IOCPBF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPCF_POSITION                 0x00000002
#define _IOCSTAT_IOCPCF_MASK                     0x00000004
#define _IOCSTAT_IOCPCF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPDF_POSITION                 0x00000003
#define _IOCSTAT_IOCPDF_MASK                     0x00000008
#define _IOCSTAT_IOCPDF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPEF_POSITION                 0x00000004
#define _IOCSTAT_IOCPEF_MASK                     0x00000010
#define _IOCSTAT_IOCPEF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPFF_POSITION                 0x00000005
#define _IOCSTAT_IOCPFF_MASK                     0x00000020
#define _IOCSTAT_IOCPFF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPGF_POSITION                 0x00000006
#define _IOCSTAT_IOCPGF_MASK                     0x00000040
#define _IOCSTAT_IOCPGF_LENGTH                   0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

