MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GA610/mcu.h
#define _ODCC_ODCC12_POSITION                    0x0000000C
#define _ODCC_ODCC12_MASK                        0x00001000
#define _ODCC_ODCC12_LENGTH                      0x00000001

#define _ODCC_ODCC13_POSITION                    0x0000000D
#define _ODCC_ODCC13_MASK                        0x00002000
#define _ODCC_ODCC13_LENGTH                      0x00000001

#define _ODCC_ODCC14_POSITION                    0x0000000E
#define _ODCC_ODCC14_MASK                        0x00004000
#define _ODCC_ODCC14_LENGTH                      0x00000001

#define _ODCC_ODCC15_POSITION                    0x0000000F
#define _ODCC_ODCC15_MASK                        0x00008000
#define _ODCC_ODCC15_LENGTH                      0x00000001

#define _ANSC_ANSC4_POSITION                     0x00000004
#define _ANSC_ANSC4_MASK                         0x00000010
#define _ANSC_ANSC4_LENGTH                       0x00000001

#define _ANSC_ANSC13_POSITION                    0x0000000D
#define _ANSC_ANSC13_MASK                        0x00002000
#define _ANSC_ANSC13_LENGTH                      0x00000001

#define _ANSC_ANSC14_POSITION                    0x0000000E
#define _ANSC_ANSC14_MASK                        0x00004000
#define _ANSC_ANSC14_LENGTH                      0x00000001

#define _ANSC_ANSELC4_POSITION                   0x00000004
#define _ANSC_ANSELC4_MASK                       0x00000010
#define _ANSC_ANSELC4_LENGTH                     0x00000001

#define _ANSC_ANSELC13_POSITION                  0x0000000D
#define _ANSC_ANSELC13_MASK                      0x00002000
#define _ANSC_ANSELC13_LENGTH                    0x00000001

#define _ANSC_ANSELC14_POSITION                  0x0000000E
#define _ANSC_ANSELC14_MASK                      0x00004000
#define _ANSC_ANSELC14_LENGTH                    0x00000001

#define _ANSELC_ANSC4_POSITION                   0x00000004
#define _ANSELC_ANSC4_MASK                       0x00000010
#define _ANSELC_ANSC4_LENGTH                     0x00000001

#define _ANSELC_ANSC13_POSITION                  0x0000000D
#define _ANSELC_ANSC13_MASK                      0x00002000
#define _ANSELC_ANSC13_LENGTH                    0x00000001

#define _ANSELC_ANSC14_POSITION                  0x0000000E
#define _ANSELC_ANSC14_MASK                      0x00004000
#define _ANSELC_ANSC14_LENGTH                    0x00000001

#define _ANSELC_ANSELC4_POSITION                 0x00000004
#define _ANSELC_ANSELC4_MASK                     0x00000010
#define _ANSELC_ANSELC4_LENGTH                   0x00000001

#define _ANSELC_ANSELC13_POSITION                0x0000000D
#define _ANSELC_ANSELC13_MASK                    0x00002000
#define _ANSELC_ANSELC13_LENGTH                  0x00000001

#define _ANSELC_ANSELC14_POSITION                0x0000000E
#define _ANSELC_ANSELC14_MASK                    0x00004000
#define _ANSELC_ANSELC14_LENGTH                  0x00000001

#define _IOCPC_IOCPC1_POSITION                   0x00000001
#define _IOCPC_IOCPC1_MASK                       0x00000002
#define _IOCPC_IOCPC1_LENGTH                     0x00000001

#define _IOCPC_IOCPC2_POSITION                   0x00000002
#define _IOCPC_IOCPC2_MASK                       0x00000004
#define _IOCPC_IOCPC2_LENGTH                     0x00000001

#define _IOCPC_IOCPC3_POSITION                   0x00000003
#define _IOCPC_IOCPC3_MASK                       0x00000008
#define _IOCPC_IOCPC3_LENGTH                     0x00000001

#define _IOCPC_IOCPC4_POSITION                   0x00000004
#define _IOCPC_IOCPC4_MASK                       0x00000010
#define _IOCPC_IOCPC4_LENGTH                     0x00000001

#define _IOCPC_IOCPC12_POSITION                  0x0000000C
#define _IOCPC_IOCPC12_MASK                      0x00001000
#define _IOCPC_IOCPC12_LENGTH                    0x00000001

#define _IOCPC_IOCPC13_POSITION                  0x0000000D
#define _IOCPC_IOCPC13_MASK                      0x00002000
#define _IOCPC_IOCPC13_LENGTH                    0x00000001

#define _IOCPC_IOCPC14_POSITION                  0x0000000E
#define _IOCPC_IOCPC14_MASK                      0x00004000
#define _IOCPC_IOCPC14_LENGTH                    0x00000001

#define _IOCPC_IOCPC15_POSITION                  0x0000000F
#define _IOCPC_IOCPC15_MASK                      0x00008000
#define _IOCPC_IOCPC15_LENGTH                    0x00000001

#define _IOCNC_IOCNC1_POSITION                   0x00000001
#define _IOCNC_IOCNC1_MASK                       0x00000002
#define _IOCNC_IOCNC1_LENGTH                     0x00000001

#define _IOCNC_IOCNC2_POSITION                   0x00000002
#define _IOCNC_IOCNC2_MASK                       0x00000004
#define _IOCNC_IOCNC2_LENGTH                     0x00000001

#define _IOCNC_IOCNC3_POSITION                   0x00000003
#define _IOCNC_IOCNC3_MASK                       0x00000008
#define _IOCNC_IOCNC3_LENGTH                     0x00000001

#define _IOCNC_IOCNC4_POSITION                   0x00000004
#define _IOCNC_IOCNC4_MASK                       0x00000010
#define _IOCNC_IOCNC4_LENGTH                     0x00000001

#define _IOCNC_IOCNC12_POSITION                  0x0000000C
#define _IOCNC_IOCNC12_MASK                      0x00001000
#define _IOCNC_IOCNC12_LENGTH                    0x00000001

#define _IOCNC_IOCNC13_POSITION                  0x0000000D
#define _IOCNC_IOCNC13_MASK                      0x00002000
#define _IOCNC_IOCNC13_LENGTH                    0x00000001

#define _IOCNC_IOCNC14_POSITION                  0x0000000E
#define _IOCNC_IOCNC14_MASK                      0x00004000
#define _IOCNC_IOCNC14_LENGTH                    0x00000001

#define _IOCNC_IOCNC15_POSITION                  0x0000000F
#define _IOCNC_IOCNC15_MASK                      0x00008000
#define _IOCNC_IOCNC15_LENGTH                    0x00000001

#define _IOCFC_IOCFC1_POSITION                   0x00000001
#define _IOCFC_IOCFC1_MASK                       0x00000002
#define _IOCFC_IOCFC1_LENGTH                     0x00000001

#define _IOCFC_IOCFC2_POSITION                   0x00000002
#define _IOCFC_IOCFC2_MASK                       0x00000004
#define _IOCFC_IOCFC2_LENGTH                     0x00000001

#define _IOCFC_IOCFC3_POSITION                   0x00000003
#define _IOCFC_IOCFC3_MASK                       0x00000008
#define _IOCFC_IOCFC3_LENGTH                     0x00000001

